tap "anomalyco/tap"
tap "buo/cask-upgrade"
tap "oven-sh/bun"

brew "anomalyco/tap/opencode"
brew "bat"
brew "btop"
brew "chezmoi"
brew "direnv"
brew "duf"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gdu"
brew "gh"
brew "git-delta"
brew "gitui"
brew "helix"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mcfly"
brew "mole"
brew "node"
brew "nono"
brew "oven-sh/bun/bun"
brew "python@3.14"
brew "rtk"
brew "starship"
brew "tmux"
brew "typst"
brew "uv"
brew "wget"
brew "yazi"
brew "zellij"
brew "zimfw"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "anydesk"
cask "browseros"
cask "clash-party"
cask "claude"
cask "cloudflare-warp"
cask "codex"
cask "dockdoor"
cask "font-maple-mono-nf-cn"
cask "ghostty"
cask "iina"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "logi-options+"
cask "maccy"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "monitorcontrol"
cask "notion"
cask "orbstack"
cask "qq"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "tailscale-app"
cask "telegram"
cask "tencent-meeting"
cask "thaw"
cask "wechat"
cask "windows-app"
cask "zed"
cask "zen"
cask "zoom"
cask "zotero"
