tap "anomalyco/tap"
tap "buo/cask-upgrade"
tap "oven-sh/bun"

brew "anomalyco/tap/opencode"
brew "bash"
brew "bat"
brew "btop"
brew "chezmoi"
brew "direnv"
brew "duf"
brew "eza"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "git-delta"
brew "helix"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mcfly"
brew "mole"
brew "node"
brew "oven-sh/bun/bun"
brew "prettier"
brew "python@3.14"
brew "ripgrep"
brew "shfmt"
brew "starship"
brew "taplo"
brew "tmux"
brew "treefmt"
brew "typst"
brew "uv"
brew "wget"
brew "yazi"
brew "zellij"
brew "zimfw"
brew "zoxide"

cask "1password"
cask "adobe-creative-cloud"
cask "baidunetdisk"
cask "chatgpt-atlas"
cask "clash-party"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "dockdoor"
cask "font-maple-mono-nf-cn"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "iina"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "logi-options+"
cask "maccy"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "monitorcontrol"
cask "notion"
cask "obs"
cask "orbstack"
cask "qq"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "superset"
cask "tailscale-app"
cask "telegram"
cask "tencent-meeting"
cask "thaw"
cask "visual-studio-code"
cask "vnc-viewer"
cask "wechat"
cask "zed"
cask "zoom"
cask "zotero@beta"
